Tekla.Structures.Drawing.PourBreak.PourBreakAttributes
The PourBreakAttributes class is the attributes class for the pour break.

Tekla.Structures.Drawing.PourBreak.PourBreakAttributes.VisibleLines
The visible line type of the pour break.

Tekla.Structures.Drawing.PourBreak.PourBreakAttributes.HiddenLines
The hidden line type of the pour break.

Tekla.Structures.Drawing.PourBreak.PourBreakAttributes.DrawHiddenLines
Indicates whether hidden lines are used to draw the pour break or not.

Tekla.Structures.Drawing.PourBreak.PourBreakAttributes.#ctor(System.Boolean)
Creates a new default pour break attributes instance that doesn't load attributes.

Tekla.Structures.Drawing.PourBreak.PourBreakAttributes.#ctor
Creates a new default pour break attributes instance that loads standard attributes.

Tekla.Structures.Drawing.PourBreak.PourBreakAttributes.#ctor(System.String)
Creates a new pour break attributes instance that loads the specified attributes.
AttributeFile: The filename of the attribute file.

Tekla.Structures.Drawing.PourBreak.PourBreakAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
AttributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.PourBreak.PourBreakAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.